
# Типы данных в питоне

# 1. None type - ничего, пустота None

# 2. Boolean - истина или ложь True/false

# 3. String - строки - str -> "hello world", 'Heloo world' 
# #My name is John snow!
# "Im North King"
# 'I\'m North king'

# #4. числовые типы данных     
          # a) integer - целое число int -> 1,21,4243
         # b) float - число с плавающей точкой -> 1.5, 15.29
         # c) range(последовательность)
             

#5. списковые типы данных (коллекция)
    # a) list(массив, список) -> [5,3,5, True, 'hello']
    # b) tuple(кортеж) -> (1,2,3, None)
    # c) rage(последовательность) -> range(1,10)

# 6. set() - множество ->  {1,2,3,4,5,6,7,8,9}

# 7. dict(словари) -> содержат данные в себе в виде ключа и значение  {1: 'one', 2: 'two'}

# Mutable (изменяемые типы данных)

# 1. list 
# 2. set 
# 3. dict

# Immutable(неизменяемые типы данных)
# 1. None
# 2. bool 
# 3. int, float, complex
# 4. str
# 5. tuple, range 
# 6. frozenset
# --------------------------------------------------------------------------------------------

# переменная - проименованная область памяти, предназначенная для хранения данных. С ее помощью мы можем проводить различные операции с данными 

num = 5 

stroka = 'hello world!'
 
'''

Стандартный вывод данных
'''

#  в питоне для вывода данных в терминал используется встроенная функция print()

# print(stroka)

# print(27 + 5)

# stroka = 'Hello world, my name is John Daun!'
  
'''

  стандартный ввод данных через терминал используется функция input()
  '''

# a = input('Введите число: ')

# # print(num)

# # print(type(num))

# # print('данные в переменных:', a, num)
# print('В переменной a хранится:', a, 'ее тип данных', type(a))

# print('В переменной num хранится', num, 'ее тип данных', type(num))
          



