# Git - это распределенная система контроля версий
# это система для отслеживания и ведения истории изменения файлов в вашем проекте. ПРи помощи рапсределенности git еще т организовывается командная работа.

# Репозиторий - это хранилище вашего кода и истории его изменений.

# Github - website для размещегия git-репозиторий в совместной разработке проектов.

# команды Git:

# 1. git init - создает локальный репозиторий, в той директории в которой была прописана команда. (Команда вводится один раз в начале)

# 2. git add - команда которая добаляет изменения в систему ослеживаний git

# 3. git commit -m '<comment>' - команда для сохранения всех изменений в локальном репозитории с комментарием к ним.

# 4. git remote add <origin> <url> - эта команда для того, чтобы связать ваш локальный репо с удаленным репо в гитхабе.

# 5. git push <origin> <main> - команда отправки всех ваших изменения на удаленный репозиторий.

# -----------------------------------------

# 1) git init
    # 2) git add
    # 3) git commit -m ''
# 4) git remote add origin <url>
    # 5) git push origin main

